app/views/articles/_articles.html.erb

INSERT INTO `articles` (`title`, `content`, `status`, `created_at`, `updated_at`) VALUES ('asdfjhj', 'sgshrejretjkktykltl', 'active', '2016-03-24 07:40:04', '2016-03-24 07:40:04')
---
        <p><%= article.content %></p>
        <div style="color: #3BB2D6;"><%= time_ago_in_words(article.created_at) %></div>

SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` IN (30, 32)
---
            <div style="background-color: #0099ff">
              <% article.comments.each do |comment| %>