app/views/articles/_article.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` IN (1, 2, 3, 5, 6, 7, 25, 26, 27, 28)
---
        <br/>
        <% article.comments.each do |comment| %>