app/views/articles/show.xls.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 55  ORDER BY id desc
---
      </Row>
    <% @article.comments.each do |comment| %>