app/controllers/articles_controller.rb

SELECT  `articles`.* FROM `articles` WHERE (title LIKE'%bandung%' or content LIKE'%bandung%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `articles` WHERE (title LIKE'%bandung%' or content LIKE'%bandung%')
---
  def index
    @articles = Article.search(params[:search]).paginate(:page => params[:page], :per_page => 10)

INSERT INTO `articles` (`title`, `content`, `status`, `created_at`, `updated_at`) VALUES ('first ajax', '1234567890', 'active', '2016-03-24 04:19:50', '2016-03-24 04:19:50')
SELECT  `articles`.* FROM `articles` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `articles`
---
  def create
    @article = Article.new(params_article)

    respond_to do |format|
      if @article.save
        @articles= Article.paginate(:page => params[:page], :per_page => 10)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1  ORDER BY id desc
---
  def show
    @article = Article.find_by_id(params[:id])
    @comments = @article.comments.all

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `title` = ' Bandung Lautan Api', `content` = '24 Maret 2016', `updated_at` = '2016-03-28 09:53:16' WHERE `articles`.`id` = 55
---
  def update

    @article = Article.find_by_id(params[:id])

    if @article.update(params_article)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 2
---
  def destroy
    @article = Article.find_by_id(params[:id])
    @article.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` IS NULL LIMIT 1
---
  def set_article
    @article = Article.find(params[:id])