app/controllers/comments_controller.rb

  def create
    respond_to do |format|
      @comment = Comment.new(params_comment)
      if @comment.save
        format.js {@comments = Article.find_by_id(params[:comment][:article_id]).comments.order("id desc")}
---
INSERT INTO `comments` (`article_id`, `user_id`, `content`, `created_at`, `updated_at`, `status`) VALUES (55, 3, '1234567890-', '2016-03-27 20:06:43', '2016-03-27 20:06:43', 'not active')
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 55 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 55  ORDER BY id desc

  def show
    @comment = Comment.find_by_id(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 55 LIMIT 1