app/controllers/sessions_controller.rb

  def edit
    user = User.find_by_activation_token(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`activation_token` = 'uke16OMon5amESYHFgus5w' LIMIT 1

  def create
    username = params[:username]
    password = params[:password]
    user = User.where("username =? and activation_status =?", username, "active").first
---
SELECT  `users`.* FROM `users` WHERE (username ='tester1' and activation_status ='active')  ORDER BY `users`.`id` ASC LIMIT 1