app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `password_salt`, `password_hash`, `created_at`, `updated_at`, `activation_token`, `activation_status`) VALUES ('tester1', 'dusmpstawn@gmail.com', '$2a$10$U8jNfdQuUsQpAAgnI9eCBe', '$2a$10$U8jNfdQuUsQpAAgnI9eCBeImS7AFsMVENJmVLhdJW.Z8H8PuM4ty2', '2016-03-27 15:46:56', '2016-03-27 15:46:56', 'uke16OMon5amESYHFgus5w', 'not activated')
---
  def create
    @user = User.new(params_user)
    User.transaction do
      if @user.save